{"stars":{"0":5,"1":5,"2":5,"3":5,"4":5,"5":5,"6":5,"7":1,"8":5,"9":5},"title":{"0":"Sturdy little lights","1":"Five Stars","2":"Love this product","3":"Light but bright","4":"You cant lose.","5":"Love the daily dealz.","6":"Love em","7":"One Star","8":"Sturdy little lights that work every time as","9":"Well-made, bright, and good deal."},"author":{"0":"S. E. Jelliff","1":"JG123","2":"Jerome Bledsoe","3":"ksmile","4":"Desertdude","5":"Andy","6":"Only in Virginia","7":"Amazon Customer","8":"David C. Bradford","9":"James G. Demian"},"date":{"0":736795,"1":736794,"2":736794,"3":736794,"4":736794,"5":736794,"6":736794,"7":736794,"8":736794,"9":736794},"body":{"0":"These are sturdy little flashlights that we plan to use in our kayaks in case we need a light. They are a lot sturdier than I would have thought for the price, and they have the flashing lights that would be of use if we find ourselves stranded out at night.","1":"EXCELLENT FLASHLIGHT ! Not sure exactly what people ,who wrote a 2 paragraph review, were expecting from a $5 flashlight !?","2":"This is the 2nd set of RockBirds I have purchased! Love this product! Sturdy, powerful beam, lightweight an compact!","3":"It is small but mighty. This little flashlight is very bright. It also is light so I can carry in my pocket, purse, or on my belt loop.","4":"Just the right size for pocket, good light ,variable beam great to work with, bottom line for the price you can't lose","5":"I purchased some larger flashlights recently but needed something that was easier to carry daily. I love the size and the build quality. Plus just one AA battery is nice. They are nice and bright and have a cool zoom feature.","6":"What a great price you just can't beat it.","7":"These are very cheaply made. Once of these broke after 2 uses.","8":"Sturdy little lights that work every time as advertised","9":"Wow. Nicely made. Work very well with Li Ion 14500 batteries as well as with AA alkaline (of course dimmer). Not hard to get used to the (stupid) inclusion of Strobe Mode. They automatically cycle from mode to mode each time you turn them off\/on with the tail switch. Hint to make your life easier (such as it is): When (not if) it turns on automatically (every third time) in strobe mode, just gently push down slightly once or twice on the switch to make it cycle between modes to get what you want. Instead of \"jumping up and down, screaming and shouting\", just think ZEN thoughts (Ooooommmm. All is beauty) and gently depress the switch.\n\nAnd think of the amazingness of this: A bright (and cheap and well-made) LED flashlight that operates on one lousy battery at 1 1\/2 volts (yes, even cheap light \"heavy duty\" non-alkalines) or an NiMH rechargeable at 1.35 volts and yet is still not destroyed by 3.7 volt Li Ion's. Would I be as enthusiastic if I'd not got them on sale at 6.99? Well, maybe a little less because the competition in quantity goes for about $3 to $4 per, and if I buy 5 or 6, I'd be giving away a few to friends and that would be even more fun.\n\nOne little nit-picky thing: the \"Two Fluorescent Rings Which Shine in the Dark Night\" (not fluorescent but phosphorescent) the \"rings\" seem to be just those (cheap) little silicone rubber bands sold in handi-craft stores that are woven together (mainly by younger people, it seems) to make rings and bracelets. Yeah, some of those are sold as glow-in-the-dark. My point is that after a few minutes in the dark, I've seen matches brighter than these -yeah UNLIT matches!\n\nOne more thing - if you use 14500 Li Ion batteries: EBL 14500 Li-ion Rechargeable Batteries 3.7V 800mAh for LED Flashlight Torch, 8 Packs most of these are what is called \"unprotected\". In this case, it means if their voltage goes down in the flashlight, they are probably going to be damaged and may never again be able to be charged to full capacity - or at all. So this is my suggestion: if the \"bulb\" starts dimming or shuts off by itself: immediately open the flashlight and take out the battery. That way the flashlight cannot draw down its voltage any more. Since there's no circuit to protect your battery, you have to do it. This should help you protect your investment and continue to give you the nice bright light these batteries give with these flashlights."},"style":{"0":"LED Flashlight 2P","1":"LED Flashlight 2P","2":"LED Flashlight 2P","3":"LED Flashlight 2P","4":"LED Flashlight 2P","5":"LED Flashlight 2P","6":"4 pack","7":"LED Flashlight 2P","8":"LED Flashlight 2P","9":"LED Flashlight 2P"},"helpful":{"0":0,"1":0,"2":0,"3":1,"4":0,"5":0,"6":0,"7":0,"8":0,"9":0}}